{
    "professional_work_experience": [
      {
        "company": "Stony Brook University",
        "role": "Graduate Teaching Assistant",
        "period": "Aug 2024 – Present",
        "details": [
          "Enhanced students’ understanding of C and Git by conducting interactive tutorials and simplifying complex concepts through structured presentations for the ESE 124 Programming Fundamentals course under Prof. Alex Doboli (Spring 2025).",
          "Created lab materials, conducted lab sessions, and graded homework for ESE 224 - Advanced Programming & Data Structures at Stony Brook University (Fall 2024).",
          "Provided additional student support during office hours under the guidance of Prof. Xin Wang."
        ]
      },
      {
        "company": "Congruent Solutions",
        "role": "Software Engineer",
        "period": "Jun 2021 – Dec 2022",
        "details": [
          "Contributed to the development of a U.S. retirement product, serving over 5M users on Azure using C#, Entity Framework, REST API, RabbitMQ, and SQL for backend and React.js, ELK for frontend integration and logging.",
          "Boosted page response time by up to 300% by optimizing database queries with Dapper ORM, Redis, indexing strategies, and stored procedures. Conducted performance testing and ANTS profiling to identify and resolve bottlenecks.",
          "Reduced manual data mapping effort by 60% by streamlining Excel column mapping to system objects through a React-integrated Web API in ASP.NET Core and leveraging Azure Functions.",
          "Accelerated debugging by 40% by implementing Serilog with Elasticsearch for log monitoring, leveraging the ELK stack (Elasticsearch, Logstash, Kibana) to enhance system observability.",
          "Automated 50% of customer email workflows by integrating SendGrid API and RabbitMQ for event-driven notification triggers.",
          "Created an intuitive dashboard for DigiMon consolidating 10+ data streams; improved data retrieval speed by 40% for quicker decision-making.",
          "Received 'Star of the Sprint Award' for Sprint 35, recognized for developing LTPT classification that led to a 20% increase in user engagement.",
          "Earned the 'TEDC Kudos Award' for exceptional skills in ASP.NET, C#, MYSQL, and REST API during the TEDC training program."
        ]
      },
      {
        "company": "SVP Laser Technologies",
        "role": "Software Engineer",
        "period": "Jul 2020 – Jun 2021",
        "details": [
          "Developed a Windows-based CNC control application for 4-axis and 5-axis machines using C#, .NET Framework, WPF, Azure Cloud Services, and Entity Framework, enhancing automation and precision in advanced manufacturing.",
          "Refined deployment speed by 60% by automating CI/CD pipelines in Azure DevOps, leveraging Docker for containerization, Azure Kubernetes Service (AKS) for orchestration, and Azure Container Registry (ACR) for image management.",
          "Increased production by 250% by developing an automated tool path generation system in C#, integrating algorithmic optimization for efficient machining.",
          "Improved data accessibility and enabled predictive maintenance by integrating Azure SQL Database and Azure Blob Storage for real-time analytics on historical performance metrics.",
          "Engineered a closed-loop feedback system with EmguCV (OpenCV), improving performance by 2x and reducing runtime by 70%.",
          "Spearheaded projects with Dr. Sathyan Subbiah from IIT Madras, integrating AI and IoT technologies into advanced manufacturing, leading to a 40% reduction in production time and a 25% increase in quality."
        ]
      },
      {
        "company": "Titan Company Limited",
        "role": "Software Engineer Intern",
        "period": "May 2019 – May 2020",
        "details": [
          "Achieved 96% accuracy in textile fiber identification using a CNN model built with Python, TensorFlow, and Keras.",
          "Simplified fabrication for prosthetic legs using a C++ OpenCV-based measurement system with 0.05 precision."
        ]
      }
    ]
  }
  